app/controllers/bookings_controller.rb

SELECT * FROM `bookings` WHERE (`bookings`.`phone` = '123123123') LIMIT 1
SELECT * FROM `bookings` WHERE (`bookings`.`email` = 'chocoberryshake@yahoo.com') LIMIT 1
---
  def create
    if !params[:booking][:phone].blank?
      @bookings = Booking.find(:all, :conditions => {:phone => params[:booking][:phone]})
      unless @bookings.empty?
        render :action => :results
      else
        flash[:notice] = 'Phone number not found or invalid'
        redirect_to bookings_url
      end
    elsif !params[:booking][:email].blank?

SELECT * FROM `bookings` WHERE (`bookings`.`id` = 2)
---
  def show
    @booking = Booking.find(params[:id])

SELECT * FROM `bookings` WHERE (`bookings`.`id` = 2)
UPDATE `bookings` SET `updated_at` = '2010-05-26 08:21:41', `claimed` = 1 WHERE `id` = 2
---
  def update
    @booking = Booking.find(params[:id])
    if @booking.claimed?
      flash[:notice] = 'This booking have been claimed.'
      redirect_to bookings_url
    else
      @booking.update_attributes!({:claimed => true})